# Install command-line tools using Homebrew


################################################
##                    TAPS                    ##
################################################

tap "raggi/ale"
tap "jlhonora/lsusb"
tap "homebrew/dupes"
tap "homebrew/fuse"
tap "homebrew/apache"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/versions"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/python"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap 'caskroom/cask'


################################################
##                    CASKS                   ##
################################################
# Configure where our applications go
cask_args appdir: '/Applications'
# get brew cask for apps
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "sublime-text"
cask "atom"
cask "filezilla"
cask "firefox"
cask "iterm2"
cask "mysqlworkbench"
cask "paw"
cask "sourcetree"
cask "spotify"
cask "transmission"
cask "vlc"
cask "little-snitch"
cask "adium"
cask "arduino"
cask "clion"
cask "colorsnapper"
cask "db-browser-for-sqlite"
cask "evernote"
cask "slack-beta"
cask "hex-fiend"
cask "angry-ip-scanner"
cask "openscad"
cask "videostream"
cask "sdformatter"
cask "sizeup"
cask "vnc-viewer"
cask "unetbootin"
cask "kaleidoscope"


################################################
##                 Brew Stuff                 ##
################################################
brew "ack"
brew "ant"
brew "gettext"
brew "libffi"
brew "cairo"
brew "perl"
brew "git"
brew "autoconf"
brew "automake"
brew "batik"
brew "bfg"
brew "binutils"
brew "mpfr"
brew "p7zip"
brew "ssdeep"
brew "boost"
brew "brew-gem"
brew "brew-pip"
brew "gmp@4"
brew "cloog"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl", args: ["with-openssl"]
brew "czmq"
brew "dbus"
brew "e2fsprogs"
brew "exiftool"
brew "faac"
brew "fdk-aac"
brew "fdupes"
brew "lame"
brew "libogg"
brew "xvid"
brew "ffmpeg", args: ["HEAD", "with-fdk-aac", "with-fontconfig", "with-freetype", "with-libvorbis", "with-openh264", "with-tools"]
brew "findutils"
brew "flex"
brew "flow"
brew "libtool"
brew "sqlite"
brew "fontforge"
brew "freexl"
brew "fswatch"
brew "gawk"
brew "mpfr@2"
brew "libmpc@0.8"
brew "gcc@4.8"
brew "json-c"
brew "proj"
brew "liblwgeom"
brew "libspatialite"
brew "gdal"
brew "gdk-pixbuf"
brew "libyaml"
brew "ruby"
brew "ghi"
brew "ghostscript"
brew "gifsicle"
brew "git-flow"
brew "libsigc++"
brew "glibmm"
brew "gnu-getopt"
brew "gnu-sed", args: ["with-default-names"]
brew "nettle"
brew "libksba"
brew "gnupg"
brew "gperf"
brew "graphicsmagick"
brew "graphviz"
brew "grc"
brew "grep"
brew "hicolor-icon-theme"
brew "gtk+"
brew "hardlink"
brew "help2man"
brew "hoedown"
brew "htop"
brew "httpd", restart_service: true
brew "httpie"
brew "httrack"
brew "imagemagick"
brew "isl@0.11"
brew "jhead"
brew "jpegoptim"
brew "lbzip2"
brew "less"
brew "libao"
brew "libvorbis"
brew "libav"
brew "libidn"
brew "libotr"
brew "libsodium"
brew "libssh2"
brew "libsvg"
brew "libusb-compat"
brew "libvo-aacenc"
brew "libxml++"
brew "lighttpd"
brew "lua"
brew "lzlib"
brew "mas"
brew "mhash"
brew "mcrypt"
brew "media-info"
brew "moreutils"
brew "mp3info"
brew "netcat"
brew "ngrep"
brew "nmap"
brew "numpy"
brew "openh264"
brew "pandoc"
brew "phantomjs"
brew "pngcrush"
brew "progress"
brew "protobuf"
brew "pv"
brew "pyenv"
brew "qt"
brew "qcachegrind"
brew "re2c"
brew "rename"
brew "ripgrep"
brew "rmtrash"
brew "sassc"
brew "screen"
brew "selenium-server-standalone"
brew "sip"
brew "slimerjs"
brew "ssh-copy-id"
brew "swftools"
brew "swig"
brew "tree"
brew "ttf2eot"
brew "ttfautohint"
brew "unixodbc"
brew "unrar"
brew "utf8proc"
# brew "vim", args: ["with-override-system-vi"]
brew "vimpager"
brew "vorbis-tools"
brew "webkit2png"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "homebrew/php/composer"
brew "homebrew/php/php71", args: ["with-homebrew-curl", "with-httpd"]
brew "homebrew/php/wp-cli"
brew "jlhonora/lsusb/lsusb"
brew "raggi/ale/openssl-osx-ca"
