# Install command-line tools using Homebrew


################################################
##                    TAPS                    ##
################################################

tap "raggi/ale"
tap "jlhonora/lsusb"
tap "homebrew/fuse"
tap "homebrew/apache"
tap "homebrew/core"
tap "homebrew/php"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
# homebrew/cask is now included by default


################################################
##                    CASKS                   ##
################################################
# Configure where our applications go
cask_args appdir: '/Applications'
# get brew cask for apps
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "sublime-text"
cask "atom"
cask "filezilla"
cask "firefox"
cask "iterm2"
cask "mysqlworkbench"
cask "paw"
cask "sourcetree"
cask "spotify"
cask "transmission"
cask "vlc"
cask "little-snitch"
cask "adium"
cask "arduino"
cask "clion"
cask "colorsnapper"
cask "db-browser-for-sqlite"
cask "evernote"
cask "slack-beta"
cask "hex-fiend"
cask "angry-ip-scanner"
cask "openscad"
cask "videostream"
cask "sdformatter"
cask "sizeup"
cask "vnc-viewer"
cask "unetbootin"
cask "kaleidoscope"
cask "java"


################################################
##                 Brew Stuff                 ##
################################################

# brew "vim", args: ["with-override-system-vi"]
brew "ack"
brew "automake"
brew "cmake"
brew "colordiff"
brew "czmq"
brew "dfu-programmer"
brew "e2fsprogs"
brew "ed"
brew "exiftool"
brew "faac"
brew "fdk-aac"
brew "fdupes"
# brew "ffmpeg", args: ["HEAD", "with-fdk-aac", "with-fontconfig", "with-freetype", "with-libvorbis", "with-openh264", "with-tools"]
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "lua"
brew "netcat"
brew "nmap"
brew "rename"
brew "rmtrash"
brew "ssh-copy-id"
brew "unrar"
brew "zsh-syntax-highlighting"

################################################
##         Currently Installed Packages       ##
################################################
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aribb24"
brew "autoconf"
brew "bat"
brew "brotli"
brew "bun"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "certifi"
brew "cjson"
brew "code-minimap"
brew "composer"
brew "coreutils"
brew "curl"
brew "dav1d"
brew "ddev"
brew "deno"
brew "eza"
brew "fd"
brew "fetch"
brew "ffmpeg"
brew "flac"
brew "fontconfig"
brew "freetds"
brew "freetype"
brew "frei0r"
brew "fribidi"
brew "fzf"
brew "gd"
brew "gettext"
brew "gh"
brew "giflib"
brew "git-delta"
brew "git-filter-repo"
brew "glib"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "go"
brew "graphite2"
brew "grc"
brew "harfbuzz"
brew "highway"
brew "htop"
brew "httrack"
brew "icu4c@77"
brew "imath"
brew "jpeg-turbo"
brew "jpeg-xl"
brew "jq"
brew "krb5"
brew "lame"
brew "leptonica"
brew "libarchive"
brew "libass"
brew "libassuan"
brew "libavif"
brew "libb2"
brew "libbluray"
brew "libdeflate"
brew "libevent"
brew "libgcrypt"
brew "libgit2"
brew "libgpg-error"
brew "libidn2"
brew "libksba"
brew "libmicrohttpd"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libogg"
brew "libpng"
brew "libpq"
brew "librist"
brew "libsamplerate"
brew "libsndfile"
brew "libsodium"
brew "libsoxr"
brew "libssh"
brew "libssh2"
brew "libtasn1"
brew "libtiff"
brew "libtool"
brew "libunibreak"
brew "libunistring"
brew "libusb"
brew "libuv"
brew "libvidstab"
brew "libvmaf"
brew "libvorbis"
brew "libvpx"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "libyaml"
brew "libzip"
brew "little-cms2"
brew "llama.cpp"
brew "lpeg"
brew "luajit"
brew "luv"
brew "lz4"
brew "lzo"
brew "m4"
brew "mbedtls"
brew "mkcert"
brew "mpdecimal"
brew "mpg123"
brew "ncurses"
brew "neovim"
brew "net-snmp"
brew "nettle"
brew "node"
brew "npth"
brew "ollama"
brew "oniguruma"
brew "opencore-amr"
brew "openexr"
brew "openjpeg"
brew "openldap"
brew "openssl@3"
brew "opus"
brew "p11-kit"
brew "pango"
brew "pcre2"
brew "pdfcrack"
brew "pdfrip"
brew "php"
brew "pinentry"
brew "pipenv"
brew "pixman"
brew "pkgconf"
brew "progress"
brew "pyenv"
brew "python@3.12"
brew "python@3.13"
brew "rav1e"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rtmpdump"
brew "rubberband"
brew "ruby"
brew "sdl2"
brew "simdjson"
brew "snappy"
brew "speedtest-cli"
brew "speex"
brew "sqlite"
brew "srt"
brew "supabase"
brew "svt-av1"
brew "terminal-notifier"
brew "tesseract"
brew "theora"
brew "tidy-html5"
brew "tree-sitter"
brew "trufflehog"
brew "unar"
brew "unbound"
brew "unibilium"
brew "unixodbc"
brew "usbutils"
brew "utf8proc"
brew "vercel-cli"
brew "visidata"
brew "webp"
brew "wget"
brew "x264"
brew "x265"
brew "xorgproto"
brew "xvid"
brew "xz"
brew "yq"
brew "zeromq"
brew "zimg"
brew "zoxide"
brew "zsh"
brew "zstd"

################################################
##              MODERN CLI TOOLS              ##
################################################
brew "bat"          # Better cat with syntax highlighting
brew "fd"           # Better find (50x faster)
brew "delta"        # Better git diff
brew "dust"         # Better du
brew "bottom"       # Better top
brew "fzf"          # Fuzzy finder for everything
brew "starship"     # Modern prompt
brew "atuin"        # Synced shell history
brew "gping"        # Better ping with graph
brew "procs"        # Better ps
brew "sd"           # Better sed
brew "hyperfine"    # Benchmarking tool
brew "tokei"        # Code statistics

cask "bruno"
cask "calibre"
cask "gcloud-cli"
cask "google-cloud-sdk"
cask "lunar"
cask "ngrok"
